src/cf/InformationRegisters/УдалитьМетодыРаспределенияКосвенныхРасходовОрганизаций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УдалитьМетодыРаспределенияКосвенныхРасходовОрганизаций</Name>
			<InformationRegisterPeriodicity>Month</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СписокСтатейЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СчетПрямыхЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодразделениеЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СчетЗатрат</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СтатьяЗатрат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/БазыРаспределенияКосвенныхРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>БазыРаспределенияКосвенныхРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбъемВыпуска</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПлановаяСебестоимость</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОплатаТруда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МатериальныеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выручка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыручкаОтРеализацииУслуг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрямыеЗатраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтдельныеСтатьиПрямыхЗатрат</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяБазаРаспределения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеРаспределяется</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/НастройкиУчетаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиУчетаЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>УстановленыВручную</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОсновнойСчетУчета</Name>
					<Type>
						<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УдалитьБазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантУчетаСтоимостиВыпуска</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыУчетаСтоимостиВыпуска</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьПлановуюСебестоимость</Name>
					<Comment>для глобальной функциональной опции</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Роль</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РолиСчетовЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Распределение</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокСтатейЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПрямыхЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Филиал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Организации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтборБазыРаспределения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НаименованиеБазы</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмеренияПоказателя</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторБазыРаспределения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КоэффициентыБазыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторБазыРаспределения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗначенияАналитикиБазыРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПредопределенные</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ПредопределеннаяАналитикаУчетаЗатрат</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеСубконто</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВидыСубконтоХозрасчетные</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторАналитики</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НастройкаАналитикиБазы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторБазыРаспределения</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>36</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>НезавершенноеПроизводство</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВариантУчета</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВариантыУчетаНезавершенногоПроизводства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазрезыУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ЗатратыНаДоставку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НеРаспределятьЗатратыНаДоставку</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РазрезыУчетаНезавершенногоПроизводства</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидАналитики</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВидыСубконтоХозрасчетные</v8:Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/InformationRegisters/УдалитьМетодыРаспределенияКосвенныхРасходовОрганизаций/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Читает данные регистра. Используется для обработки обновления при отказе от этого регистра.
//
// Параметры:
//  Настройки   - Структура - см. Справочники.НастройкиУчетаЗатрат.НовыйБазовыеНастройкиУчетаЗатрат;
//                Заполняемая коллекция
//  Период      - Дата - период действия записей регистра
//  Организация - СправочникСсылка.Организации
//
Процедура ПрочитатьНастройки(Настройки, Период, Организация) Экспорт
	
	// Для совместимости с предыдущими версиями в качестве основной базы распределения указываем ту,
	// что использовалась для затрат внутри счета 20.
	ОбщаяБазаРаспределения = БазаРаспределенияНаКалькуляционномСчете(Период, Организация);
	
	МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	
	ВсяОрганизация = БухгалтерскийУчетПереопределяемый.ВсяОрганизация(Организация);
	ЕстьФилиалы    = (ВсяОрганизация.Количество() > 1);
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Период",      КонецМесяца(Период));
	Запрос.УстановитьПараметр("Организации", ВсяОрганизация);
	Запрос.УстановитьПараметр("ЕстьФилиалы", ЕстьФилиалы);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ВЫБОР
	|		КОГДА &ЕстьФилиалы
	|			ТОГДА Настройки.Организация
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Организации.ПустаяСсылка)
	|	КОНЕЦ КАК Филиал,
	|	Настройки.СчетЗатрат КАК Счет,
	|	Настройки.Подразделение КАК Подразделение,
	|	Настройки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	Настройки.БазаРаспределения КАК БазаРаспределения,
	|	ВЫБОР
	|		КОГДА Настройки.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат)
	|			ТОГДА Настройки.СписокСтатейЗатрат
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов.ПустаяСсылка)
	|	КОНЕЦ КАК СписокСтатейЗатрат,
	|	ВЫБОР
	|		КОГДА Настройки.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияКосвенныхРасходов.Выручка)
	|			ТОГДА Настройки.СчетПрямыхЗатрат
	|		ИНАЧЕ ЗНАЧЕНИЕ(ПланСчетов.Хозрасчетный.ПустаяСсылка)
	|	КОНЕЦ КАК СчетПрямыхЗатрат,
	|	ВЫБОР
	|		КОГДА Настройки.БазаРаспределения = ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияКосвенныхРасходов.Выручка)
	|			ТОГДА Настройки.ПодразделениеЗатрат
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПодразделенияОрганизаций.ПустаяСсылка)
	|	КОНЕЦ КАК ПодразделениеЗатрат,
	|	Настройки.Период КАК ПериодНастройки,
	|	Настройки.Организация КАК Организация
	|ПОМЕСТИТЬ ДанныеРегистра
	|ИЗ
	|	РегистрСведений.УдалитьМетодыРаспределенияКосвенныхРасходовОрганизаций.СрезПоследних(&Период, Организация В (&Организации)) КАК Настройки
	|ГДЕ
	|	Настройки.БазаРаспределения <> ЗНАЧЕНИЕ(Перечисление.БазыРаспределенияКосвенныхРасходов.ПустаяСсылка)
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	Счет
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗЛИЧНЫЕ ПЕРВЫЕ 2
	|	ДанныеРегистра.БазаРаспределения КАК БазаРаспределения,
	|	ДанныеРегистра.СписокСтатейЗатрат КАК СписокСтатейЗатрат,
	|	ДанныеРегистра.СчетПрямыхЗатрат КАК СчетПрямыхЗатрат,
	|	ДанныеРегистра.ПодразделениеЗатрат КАК ПодразделениеЗатрат
	|ИЗ
	|	ДанныеРегистра КАК ДанныеРегистра
	|
	|УПОРЯДОЧИТЬ ПО
	|	СчетПрямыхЗатрат,
	|	ПодразделениеЗатрат,
	|	СписокСтатейЗатрат";
		
	Выборка = Запрос.Выполнить().Выбрать();
	КоличествоЗаписей = Выборка.Количество();
	Если КоличествоЗаписей = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Выборка.Следующий();
	
	ТребуютсяДетальныеНастройки =
		// Сохранение данных филиалов
		ЕстьФилиалы
		// Сохранение других записей регистра
		Или КоличествоЗаписей > 1
		// Разделение настроек калькуляционного счета и счетов косвенных затрат
		Или ОбщаяБазаРаспределения <> Выборка.БазаРаспределения
		// Сохранение модификаторов базы распределения косвенных затрат
		Или ИспользуютсяМодификаторыРаспределения(Выборка);
		
	Если Не ТребуютсяДетальныеНастройки Тогда
		Возврат;
	КонецЕсли;
	
	ЗакрываемыеСчета = УчетЗатрат.ПредопределенныеСчетаКосвенныхРасходов();
	
	Если КоличествоЗаписей = 1 Тогда
		НастройкаРаспределения = Настройки.Распределение.Добавить();
		ЗаполнитьЗначенияСвойств(НастройкаРаспределения, Выборка);
		Возврат;
	КонецЕсли;
	
	// Далее приоритезируем детальные записи регистра.
	
	// Учтем иерархию счетов в настройках: может быть указан
	// - пустой счет в значении "все счета"
	// - счет-группа в значении "все субсчета"
	//
	// В отличие от регистра, в настройке не допускается указывать пустые счета.
	//
	// Определим иерархию записей с незаполненными статьями затрат и подразделениями.
	// В настройке используется подход "незаполненное поле означает <все, для которых не указано явно>".
	// Поэтому одни и те же расходы могут попасть под две настройки и применяется приоритезация настроек.
	// Порядок записей в регистре не определен, поэтому приоритет определяется условным правилом:
	// если есть две подходящие настройки, в одной из которых заполнено только подразделение, а в другой - только статья,
	// то применять следует первую.
	
	СчетаНастройки = Новый ТаблицаЗначений;
	СчетаНастройки.Колонки.Добавить("СчетРегистра",  Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	СчетаНастройки.Колонки.Добавить("СчетНастройки", Новый ОписаниеТипов("ПланСчетовСсылка.Хозрасчетный"));
	СчетаНастройки.Колонки.Добавить("Приоритет",     Новый ОписаниеТипов("Число"));
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	Настройки.Счет КАК СчетРегистра,
	|	НЕ Хозрасчетный.Ссылка ЕСТЬ NULL КАК СчетСуществует
	|ИЗ
	|	ДанныеРегистра КАК Настройки
	|		ЛЕВОЕ СОЕДИНЕНИЕ ПланСчетов.Хозрасчетный КАК Хозрасчетный
	|		ПО Настройки.Счет = Хозрасчетный.Ссылка";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ЗначениеЗаполнено(Выборка.СчетРегистра) Тогда
			Запись = СчетаНастройки.Добавить();
			Запись.СчетРегистра  = Выборка.СчетРегистра;
			Запись.СчетНастройки = Выборка.СчетРегистра;
			Если Выборка.СчетСуществует Тогда
				Запись.Приоритет = Выборка.СчетРегистра.Уровень();
			КонецЕсли;
		Иначе
			Для Каждого СчетНастройки Из ЗакрываемыеСчета Цикл
				Запись = СчетаНастройки.Добавить();
				Запись.СчетРегистра  = Выборка.СчетРегистра;
				Запись.СчетНастройки = СчетНастройки;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("СчетаНастройки", СчетаНастройки);
	Запрос.Текст =
	"ВЫБРАТЬ
	|	СчетаНастройки.СчетРегистра КАК СчетРегистра,
	|	СчетаНастройки.СчетНастройки КАК СчетНастройки,
	|	СчетаНастройки.Приоритет КАК Приоритет
	|ПОМЕСТИТЬ СчетаНастройки
	|ИЗ
	|	&СчетаНастройки КАК СчетаНастройки
	|
	|ИНДЕКСИРОВАТЬ ПО
	|	СчетРегистра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	СчетаНастройки.Приоритет КАК Приоритет,
	|	ЕСТЬNULL(Настройки.Счет.Код, """") КАК СчетКод,
	|	СчетаНастройки.СчетНастройки КАК Счет,
	|	Настройки.Филиал КАК Филиал,
	|	Настройки.Подразделение КАК Подразделение,
	|	Настройки.СтатьяЗатрат КАК СтатьяЗатрат,
	|	Настройки.БазаРаспределения КАК БазаРаспределения,
	|	Настройки.СписокСтатейЗатрат КАК СписокСтатейЗатрат,
	|	Настройки.СчетПрямыхЗатрат КАК СчетПрямыхЗатрат,
	|	Настройки.ПодразделениеЗатрат КАК ПодразделениеЗатрат,
	|	"""" КАК ОтборБазыРаспределения
	|ИЗ
	|	ДанныеРегистра КАК Настройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ СчетаНастройки КАК СчетаНастройки
	|		ПО Настройки.Счет = СчетаНастройки.СчетРегистра
	|
	|УПОРЯДОЧИТЬ ПО
	|	Приоритет,
	|	СчетКод,
	|	Счет,
	|	Филиал,
	|	Подразделение,
	|	СтатьяЗатрат
	|ИТОГИ ПО
	|	Счет";
	
	ВыборкаСчет = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	Пока ВыборкаСчет.Следующий() Цикл
		
		НастройкиЗакрытияСчета = Настройки.Закрытие[ВыборкаСчет.Счет];
		Если НастройкиЗакрытияСчета = Неопределено Тогда
			Продолжить;
		КонецЕсли;
		НастройкиЗакрытияСчета.Распределение.Очистить();
		
		Выборка = ВыборкаСчет.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		ВсеНастройкиТривиальны = Истина;
		
		Пока Выборка.Следующий() Цикл
		
			ВсеНастройкиТривиальны = ВсеНастройкиТривиальны
				И Выборка.БазаРаспределения = ОбщаяБазаРаспределения
				И Не ИспользуютсяМодификаторыРаспределения(Выборка);
				
			Если ВсеНастройкиТривиальны Тогда
				Продолжить;
			КонецЕсли;
			
			НастройкаРаспределения = НастройкиЗакрытияСчета.Распределение.Добавить();
			ЗаполнитьЗначенияСвойств(НастройкаРаспределения, Выборка);
			Справочники.НастройкиУчетаЗатрат.УстановитьМодификаторБазыРаспределения(НастройкаРаспределения, Выборка);
			
		КонецЦикла;
		
	КонецЦикла;
	
	// применим общую базу распределения
	ПеренестиОбщуюБазуРаспределения(Настройки, ОбщаяБазаРаспределения);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция БазаРаспределенияНаКалькуляционномСчете(Период, Организация)
	
	// Для совместимости с предыдущими версиями в качестве основной базы распределения указываем ту,
	// что использовалась для затрат внутри счета 20.
	Если УчетнаяПолитика.ПлановаяСебестоимость(Организация, Период) Тогда
		Возврат Перечисления.БазыРаспределенияКосвенныхРасходов.ПлановаяСебестоимость;
	Иначе
		Возврат Перечисления.БазыРаспределенияКосвенныхРасходов.ПрямыеЗатраты;
	КонецЕсли;
	
КонецФункции

Функция ИспользуютсяМодификаторыРаспределения(Запись)
	
	Возврат ЗначениеЗаполнено(Запись.СписокСтатейЗатрат)
		Или ЗначениеЗаполнено(Запись.СчетПрямыхЗатрат)
		Или ЗначениеЗаполнено(Запись.ПодразделениеЗатрат);
		
КонецФункции

Процедура ПеренестиОбщуюБазуРаспределения(Настройки, ОбщаяБазаРаспределения)
	
	Если Не ЗначениеЗаполнено(ОбщаяБазаРаспределения) Тогда
		Возврат;
	КонецЕсли;
	
	Для Каждого ОписаниеНастройкиЗакрытияСчета Из Настройки.Закрытие Цикл
		
		НастройкиРаспределения = ОписаниеНастройкиЗакрытияСчета.Значение.Распределение;
		
		Если ЗначениеЗаполнено(НастройкиРаспределения)
			И Не ЗначениеЗаполнено(НастройкиРаспределения[0].Филиал)
			И Не ЗначениеЗаполнено(НастройкиРаспределения[0].Подразделение)
			И Не ЗначениеЗаполнено(НастройкиРаспределения[0].СтатьяЗатрат) Тогда
			// Для счета задана максимально общая настройка, устанавливать другую общую нет смысла
			Продолжить;
		КонецЕсли;
		
		НастройкаРаспределения = НастройкиРаспределения.Вставить(0);
		НастройкаРаспределения.БазаРаспределения = ОбщаяБазаРаспределения;
		Справочники.НастройкиУчетаЗатрат.УстановитьМодификаторБазыРаспределения(НастройкаРаспределения);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
